In [1]:
import pandas as pd

 

data = {'name': ['John', 'Jane', 'Bob'], 'age': [25, 30, 35]}

df = pd.DataFrame(data)

 

df_reindexed = df.reindex([2, 1, 0])

 

print(df_reindexed)

   name  age
2   Bob   35
1  Jane   30
0  John   25

In [7]:
import pandas as pd

 

data = {'name': ['John', 'Jane', 'Bob'], 'age': [25, 30, 35]}

df = pd.DataFrame(data)

 

for indices,row in df.iterrows():

    print(row['name'], row['age'])

John 25
Jane 30
Bob 35

In [8]:
type(df.iterrows())

generator

In [9]:
import pandas as pd

 

data = {'name': ['John', 'Jane', 'Bob'], 'age': [25, 30, 35]}

df = pd.DataFrame(data)

 

df['name_upper'] = df['name'].str.upper()

 

print(df)

   name  age name_upper
0  John   25       JOHN
1  Jane   30       JANE
2   Bob   35        BOB

In [10]:
import pandas as pd

 

data = {'name': ['Alice', 'Bob', 'Charlie'], 'age': [30, 25, 40]}

df = pd.DataFrame(data)

 

df_subset = df.loc[1:2, 'name']

 

print(df_subset)

1        Bob
2    Charlie
Name: name, dtype: object

In [30]:
df1

    name  age  gender
0  alice   25  female
1    bob   30    male
2  clair   30  female

In [110]:
import csv
data_frame=[["name","age","gender"],
           ["deepak",20,"male"],
           ["dilip",20,"male"],
           ["shivam",21,"male"],
           ["rakshak",19,"male"],
           ["avinash",19,"male"],
           ["avi",25,"female"],
           ["peeu",19,"male"],
           ["vedika",30,"female"],
           ["dipika",20,"female"],
           ["bhumi",34,"female"]]
with open("df1.csv","w") as f:
    write=csv.writer(f)
    for i in data_frame:
        write.writerow(i)

In [121]:
# Q1. List any five functions of the pandas library with execution.
import pandas as pd
# read_csv: This function is used to read data from a CSV file and return a DataFrame object.
df=pd.read_csv("df.csv")
df1=pd.read_csv("df1.csv")
# groupby() - This function groups a DataFrame by one or more columns.
group=df1.groupby(["name"])["age"].mean()
# merge(): This function is used to merge two DataFrames based on a common column.
merg1=pd.merge(df,df1,on="age")
# fillna() - This function fills missing values in a DataFrame with a specified value.
fila=df1.fillna(3)
# head() - This function returns the first n rows of a DataFrame.
top_4=df1.head()
print(df,"\n\n")
print(group,"\n\n")
print(merg1,"\n\n")
print(fila,"\n\n")
print(top_4)

    name  age  gender
0  alice   25  female
1    bob   30    male
2  clair   30  female


name
avi        25.0
avinash    19.0
bhumi      34.0
deepak     20.0
dilip      20.0
dipika     20.0
peeu       19.0
rakshak    19.0
shivam     21.0
vedika     30.0
Name: age, dtype: float64


  name_x  age gender_x  name_y gender_y
0  alice   25   female     avi   female
1    bob   30     male  vedika   female
2  clair   30   female  vedika   female


      name  age  gender
0   deepak   20    male
1    dilip   20    male
2   shivam   21    male
3  rakshak   19    male
4  avinash   19    male
5      avi   25  female
6     peeu   19    male
7   vedika   30  female
8   dipika   20  female
9    bhumi   34  female


      name  age gender
0   deepak   20   male
1    dilip   20   male
2   shivam   21   male
3  rakshak   19   male
4  avinash   19   male

In [113]:
fila.head()

      name  age gender
0   deepak   20   male
1    dilip   20   male
2   shivam   21   male
3  rakshak   19   male
4  avinash   19   male

In [123]:
def reindex_df(df):
    new_index = pd.RangeIndex(start=1, step=2, stop=len(df)*2)
    return df.set_index(new_index)
new_df = reindex_df(df)

In [125]:
new_df

    name  age  gender
1  alice   25  female
3    bob   30    male
5  clair   30  female

In [5]:
import pandas as pd

In [33]:

# Q1. Write a code to print the data present in the second row of the dataframe, df.

dta={'course_name':[ 'Data Science', 'Machine Learning', 'Big Data', 'Data Engineer'],
     'duration': [2,3,6,4],
    }
df=pd.DataFrame(dta,index=[1,2,3,4])
df
df[['course_name','duration']][2:3]

  course_name  duration
3    Big Data         6